{
  "appStoreConnect": {
    "appName": "Guid – Product Guides",
    "subtitle": "Step-by-step assembly & troubleshooting",
    "primaryCategory": "Utilities",
    "secondaryCategory": "Lifestyle",
    "contentRights": "This app does not contain third-party content that requires rights.",
    "ageRating": "4+",
    "pricing": "Free",
    "inAppPurchases": true
  },
  "description": {
    "en-US": "Guid provides clear, step-by-step assembly instructions, setup guides, and troubleshooting help for products from IKEA, Wayfair, Home Depot, Amazon, Target, and more.\n\n— FEATURES —\n\n• ASSEMBLY GUIDES: Swipe through illustrated step-by-step instructions with pinch-to-zoom on every diagram\n• AI TROUBLESHOOTING: Get instant help from our AI assistant — describe your problem or snap a photo\n• BARCODE SCANNER: Scan product barcodes to instantly find the right guide\n• OCR LABEL READER: Photograph product labels to extract article numbers automatically\n• OFFLINE GUIDES: Download guides for use without internet (Premium)\n• MULTI-RETAILER: Compare prices across retailers and find the best deals\n• DARK MODE: Full dark mode support for comfortable reading in any lighting\n\n— PREMIUM SUBSCRIPTION —\n\nUpgrade to Guid Premium for:\n• Unlimited AI chat sessions\n• Offline guide downloads\n• Priority AI processing\n• Ad-free experience\n• Photo diagnosis\n\nPricing: $9.99/month or $99.99/year\n\nPayment will be charged to your Apple ID account at confirmation of purchase. Subscription automatically renews unless canceled at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours prior to the end of the current period. You can manage and cancel your subscriptions by going to your App Store account settings after purchase.\n\nTerms of Service: https://guid.how/terms\nPrivacy Policy: https://guid.how/privacy"
  },
  "keywords": "assembly guide, IKEA instructions, furniture assembly, product guide, troubleshooting, setup guide, how to build, barcode scanner, DIY help, assembly instructions",
  "supportUrl": "https://guid.how/support",
  "marketingUrl": "https://guid.how",
  "privacyPolicyUrl": "https://guid.how/privacy",
  "screenshots": {
    "iPhone_6.7": {
      "required": true,
      "resolution": "1290x2796",
      "count": 6,
      "descriptions": [
        "Home screen with popular guides and search",
        "Product detail with image gallery and specs",
        "Step-by-step guide viewer with pinch-to-zoom",
        "AI troubleshooting chat with photo diagnosis",
        "Barcode scanner identifying a product",
        "Profile with saved products and offline guides"
      ]
    },
    "iPhone_6.5": {
      "required": true,
      "resolution": "1242x2688",
      "count": 6,
      "descriptions": "Same as 6.7 inch"
    },
    "iPad_12.9": {
      "required": false,
      "resolution": "2048x2732",
      "count": 6,
      "descriptions": "Same as iPhone, tablet layout"
    }
  },
  "reviewNotes": "Test account: test@guid.how / Test123456\n\nThe app requires an internet connection for initial product data loading. AI chat features require the Gemini API to be configured on the backend.\n\nIn-App Purchase testing: Use sandbox Apple ID for subscription testing. Product IDs: guid_premium_monthly, guid_premium_annual.",
  "buildNotes": {
    "signingCertificate": "Apple Distribution (via EAS Build)",
    "provisioningProfile": "AppStore (via EAS Build)",
    "minimumOSVersion": "16.0",
    "targetedDeviceFamilies": ["iPhone", "iPad"]
  }
}
